---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotChangeSubwall
source: html/2348028b-ac48-656d-8eeb-d83cb61e23ab.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotChangeSubwall Property

Changing the type of a subwall is not allowed. Edit the stacked wall type instead.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotChangeSubwall { get; }
```